import Top from './components/top';
import Card from './components/card';
import Bot from './components/bot';
import React, { useEffect, useState } from "react";
import './images/zeus.png';
import './components/styles/App.css';


function App() {
  const [cards, setCards] = useState([
    {
      id: 1, title: 'ЗЕВС', tags: 'Служба безпеки, монтаж технічних засобів безпеки', town: 'Одеса', site: 'zevs.ua', body: 'Агентство Безпеки «ЗЕВС» – пропонує арсенал практичних рішень щодо забезпечення технічного, пультового та фізичного захисту будь-яких об`єктів та приватних осіб з використанням сучасних технологій та обладнання. Кожне рішення  агентства, відповідає світовим стандартам захисту.',
      basesite: 'ohorona@zevs.com ', basephone: '+380 (48) 738 7777, +380 (67) 5555 911', img: './images/zeus.png'
    },
    {
       id: 2, title: 'Венбест', tags: 'Служба безпеки, монтаж технічних засобів безпеки', town: 'Одеса, Київ, Харків, Миколаїв, Дніпро і тд..', site: 'venbest.ua', body: 'Венбест є найбільшою в Україні недержавною охоронною структурою, що надає повний спектр послуг безпеки.Охоронному сервісу ВЕНБЕСТ довіряють банки, мережеві магазини, АЗК, поштові сервіси та багато інших як великі, так і маленькі.', basesite: 'office_n@venbest.com.ua', basephone: '+380 800 218 251, +380 800 306 300' 
    },
    { id: 3, title: 'Карабінер', tags: 'Служба безпеки, монтаж технічних засобів безпеки', town: 'Одеса', site: 'karabiner.ua', body: 'Охоронна служба “Карабинер” надає повний спектр послуг із захисту майна та життя, забезпечуючи високий рівень безпеки та конфіденційності.Компанія існує з 1996 року, завдяки чому ії багаторічний досвід роботи дозволяє безпомилково оцінювати обстановку на конкретному об’єкті та припиняти загрозу безпеці майна.', basesite: 'office@karabiner.ua', basephone: '+38048 785 59 30, +38067 488 26 06'  },
    { id: 4, title: 'Шериф', tags: 'Служба безпеки, монтаж технічних засобів безпеки', town: 'Київ, Львів, Рівне, Чернівці', site: 'sheriff.com.ua', body: 'Холдинг "Шериф" надає комплекс послуг із забезпечення безпеки об`єктів різної складності та масштабу, супроводу вантажів, охорони інкасаторів, приватних осіб, масових заходів та інше.', basesite: 'pr@sheriff.com.ua', basephone: '+380 800 202 837' },
    { id: 5, title: 'Гепард',  tags: 'Служба безпеки, монтаж технічних засобів безпеки', town: 'Одеса', site: 'gepard.od.ua', body: 'Гепард НДСО - ​це злагоджений та перевірений колектив професіоналів, що забезпечує кваліфіковану та багатопрофільну охорону в місті Одесі та області, а також надає на найвищому рівні юридичні та детективні послуги.', basesite: '', basephone:'+380-675-51-18-28, +380-637-62-88-40'},
    { id: 6, title: 'Легіон',  tags: 'Служба безпеки, монтаж технічних засобів безпеки', town: 'Ужгород, Закарпаття', site: 'legion.com.ua', body: 'Компанія пропонує послуги, пов’язані з безпекою та охороною. При цьому до кожного клієнта підходить індивідуально. Нею користуються 1500 клієнтів.', basesite: '', basephone:'+38 050 732-29-00, +38 067 679-69-97' },
    { id: 7, title: 'Центр',  tags: 'Служба безпеки, монтаж технічних засобів безпеки', town: 'Одеса, Київ, Миколаїв', site: 'centr.od.ua', body: 'Компанія працює 24 роки. Надає весь спектр охоронних послуг: від охоронно-пожежної сигналізації до особистої охорони ', basesite: 'info@centr.od.ua', basephone:'+380 800 21-911-0' },
    { id: 8, title: 'Грифон',  tags: 'Служба безпеки, монтаж технічних засобів безпеки', town: 'Одеса', site: 'grifon.od.ua', body: 'Агентство безпеки «Грифон-СБ» пропонує Вам комплексну безпеку та надає пакет послуг, у якому є все, що необхідно для забезпечення безпеки фізичних осіб, а також суб`єктів підприємницької діяльності різних форм власності', basesite: 'grifon.sb@gmail.com', basephone:'+38 068 750 83 80, +38 048 787-64-76' },
  ])

  return (
    <div className="App">
      <Top />
      {cards.map((card) =>
        <Card card={card} key={card.id} />
      )}
      <Bot />
    </div>
  );
}

export default App;
